# Agregar y eliminar datos con Pandas

In [2]:
import pandas as pd

In [3]:
df_books = pd.read_csv('data/bestsellers.csv', sep=",", header=0)

In [4]:
df_books.head(2)

,Name,Author,User Rating,Reviews,Price,Year,Genre
0,10-Day Green Smoothie Cleanse,JJ Smith,4.7,17350,8,2016,Non Fiction
1,11/22/63: A Novel,Stephen King,4.6,2052,22,2011,Fiction

## Drop columns

In [5]:
# Borra la columna Year
df_books.drop('Year', axis=1).head(2) 

# Borrar de forma definitiva
# df_books.drop('Year', axis=1, inplace=True)

,Name,Author,User Rating,Reviews,Price,Genre
0,10-Day Green Smoothie Cleanse,JJ Smith,4.7,17350,8,Non Fiction
1,11/22/63: A Novel,Stephen King,4.6,2052,22,Fiction

In [6]:
# Borra la columna Name
df_books.drop('Name', axis=1).head(2)

         Author  User Rating  Reviews  Price  Year        Genre
0      JJ Smith          4.7    17350      8  2016  Non Fiction
1  Stephen King          4.6     2052     22  2011      Fiction

## Drop rows

In [7]:
# Borra la fila 1
df_books.drop(1, axis=0).head(2)

,Name,Author,User Rating,Reviews,Price,Year,Genre
0,10-Day Green Smoothie Cleanse,JJ Smith,4.7,17350,8,2016,Non Fiction
2,12 Rules for Life: An Antidote to Chaos,Jordan B. Peterson,4.7,18979,15,2018,Non Fiction

In [8]:
# Borra las filas 1, 2 y 3
df_books.drop([1, 2, 3], axis=0).head(2)

,Name,Author,User Rating,Reviews,Price,Year,Genre
0,10-Day Green Smoothie Cleanse,JJ Smith,4.7,17350,8,2016,Non Fiction
4,"5,000 Awesome Facts (About Everything!) (Natio...",National Geographic Kids,4.8,7665,12,2019,Non Fiction

In [9]:
# Borra los primeros 10 registros
df_books.drop(range(10), axis=0).head(2)

,Name,Author,User Rating,Reviews,Price,Year,Genre
10,A Man Called Ove: A Novel,Fredrik Backman,4.6,23848,8,2017,Fiction
11,A Patriot's History of the United States: From...,Larry Schweikart,4.6,460,2,2010,Non Fiction

## Add columns

In [13]:
import numpy as np
df_books.head(2)

,Name,Author,User Rating,Reviews,Price,Year,Genre
0,10-Day Green Smoothie Cleanse,JJ Smith,4.7,17350,8,2016,Non Fiction
1,11/22/63: A Novel,Stephen King,4.6,2052,22,2011,Fiction

In [16]:
df_books["Nueva columna"] = np.nan
df_books.head(2)

,Name,Author,User Rating,Reviews,Price,Year,Genre,Nueva columna
0,10-Day Green Smoothie Cleanse,JJ Smith,4.7,17350,8,2016,Non Fiction,NaN
1,11/22/63: A Novel,Stephen King,4.6,2052,22,2011,Fiction,NaN

In [24]:
data = np.arange(0, df_books.shape[0])

In [27]:
df_books["Rango"] = data
df_books.head(2)

,Name,Author,User Rating,Reviews,Price,Year,Genre,Nueva columna,Rango
0,10-Day Green Smoothie Cleanse,JJ Smith,4.7,17350,8,2016,Non Fiction,NaN,0
1,11/22/63: A Novel,Stephen King,4.6,2052,22,2011,Fiction,NaN,1

In [34]:
new_rango = np.random.randint(1, 550, 550)

df_books["Nuevo Rango"] = new_rango
df_books

,Name,Author,User Rating,Reviews,Price,Year,Genre,Nueva columna,Rango,Nuevo Rango
0,10-Day Green Smoothie Cleanse,JJ Smith,4.7,17350,8,2016,Non Fiction,NaN,0,251
1,11/22/63: A Novel,Stephen King,4.6,2052,22,2011,Fiction,NaN,1,290
2,12 Rules for Life: An Antidote to Chaos,Jordan B. Peterson,4.7,18979,15,2018,Non Fiction,NaN,2,151
3,1984 (Signet Classics),George Orwell,4.7,21424,6,2017,Fiction,NaN,3,23
4,"5,000 Awesome Facts (About Everything!) (Natio...",National Geographic Kids,4.8,7665,12,2019,Non Fiction,NaN,4,509
...,...,...,...,...,...,...,...,...,...,...
545,Wrecking Ball (Diary of a Wimpy Kid Book 14),Jeff Kinney,4.9,9413,8,2019,Fiction,NaN,545,364
546,You Are a Badass: How to Stop Doubting Your Gr...,Jen Sincero,4.7,14331,8,2016,Non Fiction,NaN,546,357
547,You Are a Badass: How to Stop Doubting Your Gr...,Jen Sincero,4.7,14331,8,2017,Non Fiction,NaN,547,280
548,You Are a Badass: How to Stop Doubting Your Gr...,Jen Sincero,4.7,14331,8,2018,Non Fiction,NaN,548,472
549,You Are a Badass: How to Stop Doubting Your Gr...,Jen Sincero,4.7,14331,8,2019,Non Fiction,NaN,549,15

In [44]:
drop_head = df_books.iloc[:0, 7:9]

dd = df_books.drop(drop_head, axis=1).head(2)
dd

,Name,Author,User Rating,Reviews,Price,Year,Genre,Nuevo Rango
0,10-Day Green Smoothie Cleanse,JJ Smith,4.7,17350,8,2016,Non Fiction,251
1,11/22/63: A Novel,Stephen King,4.6,2052,22,2011,Fiction,290

## Add rows

In [45]:
df_books.append(df_books)

C:\Users\kenyi\AppData\Local\Temp\ipykernel_6692\1991810635.py:1: FutureWarning: The frame.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  df_books.append(df_books)

,Name,Author,User Rating,Reviews,Price,Year,Genre,Nueva columna,Rango,Nuevo Rango
0,10-Day Green Smoothie Cleanse,JJ Smith,4.7,17350,8,2016,Non Fiction,NaN,0,251
1,11/22/63: A Novel,Stephen King,4.6,2052,22,2011,Fiction,NaN,1,290
2,12 Rules for Life: An Antidote to Chaos,Jordan B. Peterson,4.7,18979,15,2018,Non Fiction,NaN,2,151
3,1984 (Signet Classics),George Orwell,4.7,21424,6,2017,Fiction,NaN,3,23
4,"5,000 Awesome Facts (About Everything!) (Natio...",National Geographic Kids,4.8,7665,12,2019,Non Fiction,NaN,4,509
...,...,...,...,...,...,...,...,...,...,...
545,Wrecking Ball (Diary of a Wimpy Kid Book 14),Jeff Kinney,4.9,9413,8,2019,Fiction,NaN,545,364
546,You Are a Badass: How to Stop Doubting Your Gr...,Jen Sincero,4.7,14331,8,2016,Non Fiction,NaN,546,357
547,You Are a Badass: How to Stop Doubting Your Gr...,Jen Sincero,4.7,14331,8,2017,Non Fiction,NaN,547,280
548,You Are a Badass: How to Stop Doubting Your Gr...,Jen Sincero,4.7,14331,8,2018,Non Fiction,NaN,548,472
549,You Are a Badass: How to Stop Doubting Your Gr...,Jen Sincero,4.7,14331,8,2019,Non Fiction,NaN,549,15

### Reto personal
- Borrar columnas por indice

In [11]:
# Seleccionamos solo las cabeceras
heads_drop = df_books.iloc[:0, 1:7:2]
print(heads_drop)
print(df_books.iloc[:0, :])

# Borramos las cabeceras sellecionadas en la variable heads_drop
df_books.drop(heads_drop, axis=1).head(2)

Empty DataFrame
Columns: [Author, Reviews, Year]
Index: []
Empty DataFrame
Columns: [Name, Author, User Rating, Reviews, Price, Year, Genre]
Index: []

                            Name  User Rating  Price        Genre
0  10-Day Green Smoothie Cleanse          4.7      8  Non Fiction
1              11/22/63: A Novel          4.6     22      Fiction